remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/pio/pio_samb11g18a.h
/**
 * \file
 *
 * \brief Peripheral I/O description for SAMB11G18A
 *
 * Copyright (c) 2016-2018 Microchip Technology Inc. and its subsidiaries.
 *
 * \asf_license_start
 *
 * \page License
 *
 * Subject to your compliance with these terms, you may use Microchip
 * software and any derivatives exclusively with Microchip products.
 * It is your responsibility to comply with third party license terms applicable
 * to your use of third party software (including open source software) that
 * may accompany Microchip software.
 *
 * THIS SOFTWARE IS SUPPLIED BY MICROCHIP "AS IS". NO WARRANTIES,
 * WHETHER EXPRESS, IMPLIED OR STATUTORY, APPLY TO THIS SOFTWARE,
 * INCLUDING ANY IMPLIED WARRANTIES OF NON-INFRINGEMENT, MERCHANTABILITY,
 * AND FITNESS FOR A PARTICULAR PURPOSE. IN NO EVENT WILL MICROCHIP BE
 * LIABLE FOR ANY INDIRECT, SPECIAL, PUNITIVE, INCIDENTAL OR CONSEQUENTIAL
 * LOSS, DAMAGE, COST OR EXPENSE OF ANY KIND WHATSOEVER RELATED TO THE
 * SOFTWARE, HOWEVER CAUSED, EVEN IF MICROCHIP HAS BEEN ADVISED OF THE
 * POSSIBILITY OR THE DAMAGES ARE FORESEEABLE.  TO THE FULLEST EXTENT
 * ALLOWED BY LAW, MICROCHIP'S TOTAL LIABILITY ON ALL CLAIMS IN ANY WAY
 * RELATED TO THIS SOFTWARE WILL NOT EXCEED THE AMOUNT OF FEES, IF ANY,
 * THAT YOU HAVE PAID DIRECTLY TO MICROCHIP FOR THIS SOFTWARE.
 *
 * \asf_license_stop
 *
 */

#ifndef _SAMB11G18A_PIO_
#define _SAMB11G18A_PIO_

#define PIN_LP_GPIO_0                     0  /**< \brief Pin Number for LP_GPIO_0 */
#define GPIO_LP_GPIO_0           (1ul <<  0) /**< \brief GPIO Mask for LP_GPIO_0 */
#define PIN_LP_GPIO_1                     1  /**< \brief Pin Number for LP_GPIO_1 */
#define GPIO_LP_GPIO_1           (1ul <<  1) /**< \brief GPIO Mask for LP_GPIO_1 */
#define PIN_LP_GPIO_2                     2  /**< \brief Pin Number for LP_GPIO_2 */
#define GPIO_LP_GPIO_2           (1ul <<  2) /**< \brief GPIO Mask for LP_GPIO_2 */
#define PIN_LP_GPIO_3                     3  /**< \brief Pin Number for LP_GPIO_3 */
#define GPIO_LP_GPIO_3           (1ul <<  3) /**< \brief GPIO Mask for LP_GPIO_3 */
#define PIN_LP_GPIO_4                     4  /**< \brief Pin Number for LP_GPIO_4 */
#define GPIO_LP_GPIO_4           (1ul <<  4) /**< \brief GPIO Mask for LP_GPIO_4 */
#define PIN_LP_GPIO_5                     5  /**< \brief Pin Number for LP_GPIO_5 */
#define GPIO_LP_GPIO_5           (1ul <<  5) /**< \brief GPIO Mask for LP_GPIO_5 */
#define PIN_LP_GPIO_6                     6  /**< \brief Pin Number for LP_GPIO_6 */
#define GPIO_LP_GPIO_6           (1ul <<  6) /**< \brief GPIO Mask for LP_GPIO_6 */
#define PIN_LP_GPIO_7                     7  /**< \brief Pin Number for LP_GPIO_7 */
#define GPIO_LP_GPIO_7           (1ul <<  7) /**< \brief GPIO Mask for LP_GPIO_7 */
#define PIN_LP_GPIO_8                     8  /**< \brief Pin Number for LP_GPIO_8 */
#define GPIO_LP_GPIO_8           (1ul <<  8) /**< \brief GPIO Mask for LP_GPIO_8 */
#define PIN_LP_GPIO_9                     9  /**< \brief Pin Number for LP_GPIO_9 */
#define GPIO_LP_GPIO_9           (1ul <<  9) /**< \brief GPIO Mask for LP_GPIO_9 */
#define PIN_LP_GPIO_10                   10  /**< \brief Pin Number for LP_GPIO_10 */
#define GPIO_LP_GPIO_10          (1ul << 10) /**< \brief GPIO Mask for LP_GPIO_10 */
#define PIN_LP_GPIO_11                   11  /**< \brief Pin Number for LP_GPIO_11 */
#define GPIO_LP_GPIO_11          (1ul << 11) /**< \brief GPIO Mask for LP_GPIO_11 */
#define PIN_LP_GPIO_12                   12  /**< \brief Pin Number for LP_GPIO_12 */
#define GPIO_LP_GPIO_12          (1ul << 12) /**< \brief GPIO Mask for LP_GPIO_12 */
#define PIN_LP_GPIO_13                   13  /**< \brief Pin Number for LP_GPIO_13 */
#define GPIO_LP_GPIO_13          (1ul << 13) /**< \brief GPIO Mask for LP_GPIO_13 */
#define PIN_LP_GPIO_14                   14  /**< \brief Pin Number for LP_GPIO_14 */
#define GPIO_LP_GPIO_14          (1ul << 14) /**< \brief GPIO Mask for LP_GPIO_14 */
#define PIN_LP_GPIO_15                   15  /**< \brief Pin Number for LP_GPIO_15 */
#define GPIO_LP_GPIO_15          (1ul << 15) /**< \brief GPIO Mask for LP_GPIO_15 */
#define PIN_LP_GPIO_16                   16  /**< \brief Pin Number for LP_GPIO_16 */
#define GPIO_LP_GPIO_16          (1ul <<  0) /**< \brief GPIO Mask for LP_GPIO_16 */
#define PIN_LP_GPIO_17                   17  /**< \brief Pin Number for LP_GPIO_17 */
#define GPIO_LP_GPIO_17          (1ul <<  1) /**< \brief GPIO Mask for LP_GPIO_17 */
#define PIN_LP_GPIO_18                   18  /**< \brief Pin Number for LP_GPIO_18 */
#define GPIO_LP_GPIO_18          (1ul <<  2) /**< \brief GPIO Mask for LP_GPIO_18 */
#define PIN_LP_GPIO_19                   19  /**< \brief Pin Number for LP_GPIO_19 */
#define GPIO_LP_GPIO_19          (1ul <<  3) /**< \brief GPIO Mask for LP_GPIO_19 */
#define PIN_LP_GPIO_20                   20  /**< \brief Pin Number for LP_GPIO_20 */
#define GPIO_LP_GPIO_20          (1ul <<  4) /**< \brief GPIO Mask for LP_GPIO_20 */
#define PIN_LP_GPIO_22                   22  /**< \brief Pin Number for LP_GPIO_22 */
#define GPIO_LP_GPIO_22          (1ul <<  6) /**< \brief GPIO Mask for LP_GPIO_22 */
#define PIN_LP_GPIO_23                   23  /**< \brief Pin Number for LP_GPIO_23 */
#define GPIO_LP_GPIO_23          (1ul <<  7) /**< \brief GPIO Mask for LP_GPIO_23 */
#define PIN_AO_GPIO_2                    29  /**< \brief Pin Number for AO_GPIO_2 */
#define GPIO_AO_GPIO_2           (1ul << 13) /**< \brief GPIO Mask for AO_GPIO_2 */
#define PIN_AO_GPIO_1                    30  /**< \brief Pin Number for AO_GPIO_1 */
#define GPIO_AO_GPIO_1           (1ul << 14) /**< \brief GPIO Mask for AO_GPIO_1 */
#define PIN_AO_GPIO_0                    31  /**< \brief Pin Number for AO_GPIO_0 */
#define GPIO_AO_GPIO_0           (1ul << 15) /**< \brief GPIO Mask for AO_GPIO_0 */
#define PIN_GPIO_MS4                     44  /**< \brief Pin Number for GPIO_MS4 */
#define GPIO_GPIO_MS4            (1ul << 12) /**< \brief GPIO Mask for GPIO_MS4 */
#define PIN_GPIO_MS3                     45  /**< \brief Pin Number for GPIO_MS3 */
#define GPIO_GPIO_MS3            (1ul << 13) /**< \brief GPIO Mask for GPIO_MS3 */
#define PIN_GPIO_MS2                     46  /**< \brief Pin Number for GPIO_MS2 */
#define GPIO_GPIO_MS2            (1ul << 14) /**< \brief GPIO Mask for GPIO_MS2 */
#define PIN_GPIO_MS1                     47  /**< \brief Pin Number for GPIO_MS1 */
#define GPIO_GPIO_MS1            (1ul << 15) /**< \brief GPIO Mask for GPIO_MS1 */

