remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/pio/pio_samb11g18a.h
/* ========== PIO definition for I2C0 peripheral ========== */
#define PIN_LP_GPIO_8_MUX2_I2C0_SDA                8L           /**< \brief I2C0 signal: SDA on LP_GPIO_8 mux MUX2*/
#define MUX_LP_GPIO_8_MUX2_I2C0_SDA                2           
#define PINMUX_LP_GPIO_8_MUX2_I2C0_SDA             ((PIN_LP_GPIO_8_MUX2_I2C0_SDA << 16) | MUX_LP_GPIO_8_MUX2_I2C0_SDA)

#define PIN_LP_GPIO_9_MUX2_I2C0_SCL                9L           /**< \brief I2C0 signal: SCL on LP_GPIO_9 mux MUX2*/
#define MUX_LP_GPIO_9_MUX2_I2C0_SCL                2           
#define PINMUX_LP_GPIO_9_MUX2_I2C0_SCL             ((PIN_LP_GPIO_9_MUX2_I2C0_SCL << 16) | MUX_LP_GPIO_9_MUX2_I2C0_SCL)

/* ========== PIO definition for I2C1 peripheral ========== */
#define PIN_LP_GPIO_14_MUX4_I2C1_SDA               14L          /**< \brief I2C1 signal: SDA on LP_GPIO_14 mux MUX4*/
#define MUX_LP_GPIO_14_MUX4_I2C1_SDA               4           
#define PINMUX_LP_GPIO_14_MUX4_I2C1_SDA            ((PIN_LP_GPIO_14_MUX4_I2C1_SDA << 16) | MUX_LP_GPIO_14_MUX4_I2C1_SDA)

#define PIN_LP_GPIO_15_MUX4_I2C1_SCL               15L          /**< \brief I2C1 signal: SCL on LP_GPIO_15 mux MUX4*/
#define MUX_LP_GPIO_15_MUX4_I2C1_SCL               4           
#define PINMUX_LP_GPIO_15_MUX4_I2C1_SCL            ((PIN_LP_GPIO_15_MUX4_I2C1_SCL << 16) | MUX_LP_GPIO_15_MUX4_I2C1_SCL)

/* ========== PIO definition for UART0 peripheral ========== */
#define PIN_LP_GPIO_2_MUX2_UART0_RXD               2L           /**< \brief UART0 signal: RXD on LP_GPIO_2 mux MUX2*/
#define MUX_LP_GPIO_2_MUX2_UART0_RXD               2           
#define PINMUX_LP_GPIO_2_MUX2_UART0_RXD            ((PIN_LP_GPIO_2_MUX2_UART0_RXD << 16) | MUX_LP_GPIO_2_MUX2_UART0_RXD)

#define PIN_LP_GPIO_3_MUX2_UART0_TXD               3L           /**< \brief UART0 signal: TXD on LP_GPIO_3 mux MUX2*/
#define MUX_LP_GPIO_3_MUX2_UART0_TXD               2           
#define PINMUX_LP_GPIO_3_MUX2_UART0_TXD            ((PIN_LP_GPIO_3_MUX2_UART0_TXD << 16) | MUX_LP_GPIO_3_MUX2_UART0_TXD)


#define PIN_LP_GPIO_4_MUX2_UART0_CTS               4L           /**< \brief UART0 signal: CTS on LP_GPIO_4 mux MUX2*/
#define MUX_LP_GPIO_4_MUX2_UART0_CTS               2           
#define PINMUX_LP_GPIO_4_MUX2_UART0_CTS            ((PIN_LP_GPIO_4_MUX2_UART0_CTS << 16) | MUX_LP_GPIO_4_MUX2_UART0_CTS)

#define PIN_LP_GPIO_5_MUX2_UART0_RTS               5L           /**< \brief UART0 signal: RTS on LP_GPIO_5 mux MUX2*/
#define MUX_LP_GPIO_5_MUX2_UART0_RTS               2           
#define PINMUX_LP_GPIO_5_MUX2_UART0_RTS            ((PIN_LP_GPIO_5_MUX2_UART0_RTS << 16) | MUX_LP_GPIO_5_MUX2_UART0_RTS)

/* ========== PIO definition for UART1 peripheral ========== */
#define PIN_LP_GPIO_6_MUX2_UART1_RXD               6L           /**< \brief UART1 signal: RXD on LP_GPIO_6 mux MUX2*/
#define MUX_LP_GPIO_6_MUX2_UART1_RXD               2           
#define PINMUX_LP_GPIO_6_MUX2_UART1_RXD            ((PIN_LP_GPIO_6_MUX2_UART1_RXD << 16) | MUX_LP_GPIO_6_MUX2_UART1_RXD)

#define PIN_LP_GPIO_7_MUX2_UART1_TXD               7L           /**< \brief UART1 signal: TXD on LP_GPIO_7 mux MUX2*/
#define MUX_LP_GPIO_7_MUX2_UART1_TXD               2           
#define PINMUX_LP_GPIO_7_MUX2_UART1_TXD            ((PIN_LP_GPIO_7_MUX2_UART1_TXD << 16) | MUX_LP_GPIO_7_MUX2_UART1_TXD)

#define PIN_LP_GPIO_14_MUX2_UART1_CTS              14L          /**< \brief UART1 signal: CTS on LP_GPIO_14 mux MUX2*/
#define MUX_LP_GPIO_14_MUX2_UART1_CTS              2           
#define PINMUX_LP_GPIO_14_MUX2_UART1_CTS           ((PIN_LP_GPIO_14_MUX2_UART1_CTS << 16) | MUX_LP_GPIO_14_MUX2_UART1_CTS)

#define PIN_LP_GPIO_15_MUX2_UART1_RTS              15L          /**< \brief UART1 signal: RTS on LP_GPIO_15 mux MUX2*/
#define MUX_LP_GPIO_15_MUX2_UART1_RTS              2           
#define PINMUX_LP_GPIO_15_MUX2_UART1_RTS           ((PIN_LP_GPIO_15_MUX2_UART1_RTS << 16) | MUX_LP_GPIO_15_MUX2_UART1_RTS)

/* ========== PIO definition for SPI0 peripheral ========== */
#define PIN_LP_GPIO_10_MUX2_SPI0_SCK               10L          /**< \brief SPI0 signal: SCK on LP_GPIO_10 mux MUX2*/
#define MUX_LP_GPIO_10_MUX2_SPI0_SCK               2           
#define PINMUX_LP_GPIO_10_MUX2_SPI0_SCK            ((PIN_LP_GPIO_10_MUX2_SPI0_SCK << 16) | MUX_LP_GPIO_10_MUX2_SPI0_SCK)

#define PIN_LP_GPIO_2_MUX5_SPI0_SCK                2L           /**< \brief SPI0 signal: SCK on LP_GPIO_2 mux MUX5*/
#define MUX_LP_GPIO_2_MUX5_SPI0_SCK                5           
#define PINMUX_LP_GPIO_2_MUX5_SPI0_SCK             ((PIN_LP_GPIO_2_MUX5_SPI0_SCK << 16) | MUX_LP_GPIO_2_MUX5_SPI0_SCK)

#define PIN_LP_GPIO_6_MUX5_SPI0_SCK                6L           /**< \brief SPI0 signal: SCK on LP_GPIO_6 mux MUX5*/
#define MUX_LP_GPIO_6_MUX5_SPI0_SCK                5           
#define PINMUX_LP_GPIO_6_MUX5_SPI0_SCK             ((PIN_LP_GPIO_6_MUX5_SPI0_SCK << 16) | MUX_LP_GPIO_6_MUX5_SPI0_SCK)

#define PIN_LP_GPIO_16_MUX5_SPI0_SCK               16L           /**< \brief SPI0 signal: SCK on LP_GPIO_16 mux MUX5*/
#define MUX_LP_GPIO_16_MUX5_SPI0_SCK               5           
#define PINMUX_LP_GPIO_16_MUX5_SPI0_SCK            ((PIN_LP_GPIO_16_MUX5_SPI0_SCK << 16) | MUX_LP_GPIO_16_MUX5_SPI0_SCK)

#define PIN_LP_GPIO_11_MUX2_SPI0_MOSI              11L          /**< \brief SPI0 signal: MOSI on LP_GPIO_11 mux MUX2*/
#define MUX_LP_GPIO_11_MUX2_SPI0_MOSI              2           
#define PINMUX_LP_GPIO_11_MUX2_SPI0_MOSI           ((PIN_LP_GPIO_11_MUX2_SPI0_MOSI << 16) | MUX_LP_GPIO_11_MUX2_SPI0_MOSI)

#define PIN_LP_GPIO_3_MUX5_SPI0_MOSI               3L           /**< \brief SPI0 signal: MOSI on LP_GPIO_3 mux MUX5*/
#define MUX_LP_GPIO_3_MUX5_SPI0_MOSI               5           
#define PINMUX_LP_GPIO_3_MUX5_SPI0_MOSI            ((PIN_LP_GPIO_3_MUX5_SPI0_MOSI << 16) | MUX_LP_GPIO_3_MUX5_SPI0_MOSI)

#define PIN_LP_GPIO_7_MUX5_SPI0_MOSI               7L           /**< \brief SPI0 signal: MOSI on LP_GPIO_7 mux MUX5*/
#define MUX_LP_GPIO_7_MUX5_SPI0_MOSI               5           
#define PINMUX_LP_GPIO_7_MUX5_SPI0_MOSI            ((PIN_LP_GPIO_7_MUX5_SPI0_MOSI << 16) | MUX_LP_GPIO_7_MUX5_SPI0_MOSI)

#define PIN_LP_GPIO_17_MUX5_SPI0_MOSI              17L           /**< \brief SPI0 signal: MOSI on LP_GPIO_17 mux MUX5*/
#define MUX_LP_GPIO_17_MUX5_SPI0_MOSI              5           
#define PINMUX_LP_GPIO_17_MUX5_SPI0_MOSI           ((PIN_LP_GPIO_17_MUX5_SPI0_MOSI << 16) | MUX_LP_GPIO_17_MUX5_SPI0_MOSI)

#define PIN_LP_GPIO_12_MUX2_SPI0_SSN               12L          /**< \brief SPI0 signal: SSN on LP_GPIO_12 mux MUX2*/
#define MUX_LP_GPIO_12_MUX2_SPI0_SSN               2           
#define PINMUX_LP_GPIO_12_MUX2_SPI0_SSN            ((PIN_LP_GPIO_12_MUX2_SPI0_SSN << 16) | MUX_LP_GPIO_12_MUX2_SPI0_SSN)

#define PIN_LP_GPIO_4_MUX5_SPI0_SSN                4L           /**< \brief SPI0 signal: SSN on LP_GPIO_4 mux MUX5*/
#define MUX_LP_GPIO_4_MUX5_SPI0_SSN                5           
#define PINMUX_LP_GPIO_4_MUX5_SPI0_SSN             ((PIN_LP_GPIO_4_MUX5_SPI0_SSN << 16) | MUX_LP_GPIO_4_MUX5_SPI0_SSN)

#define PIN_LP_GPIO_8_MUX5_SPI0_SSN                8L           /**< \brief SPI0 signal: SSN on LP_GPIO_8 mux MUX5*/
#define MUX_LP_GPIO_8_MUX5_SPI0_SSN                5           
#define PINMUX_LP_GPIO_8_MUX5_SPI0_SSN             ((PIN_LP_GPIO_8_MUX5_SPI0_SSN << 16) | MUX_LP_GPIO_8_MUX5_SPI0_SSN)

