remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/pio/pio_samb11g18a.h
#define PIN_LP_GPIO_18_MUX5_SPI0_SSN               18L           /**< \brief SPI0 signal: SSN on LP_GPIO_18 mux MUX5*/
#define MUX_LP_GPIO_18_MUX5_SPI0_SSN               5           
#define PINMUX_LP_GPIO_18_MUX5_SPI0_SSN            ((PIN_LP_GPIO_18_MUX5_SPI0_SSN << 16) | MUX_LP_GPIO_18_MUX5_SPI0_SSN)

#define PIN_LP_GPIO_13_MUX2_SPI0_MISO              13L          /**< \brief SPI0 signal: MISO on LP_GPIO_13 mux MUX2*/
#define MUX_LP_GPIO_13_MUX2_SPI0_MISO              2           
#define PINMUX_LP_GPIO_13_MUX2_SPI0_MISO           ((PIN_LP_GPIO_13_MUX2_SPI0_MISO << 16) | MUX_LP_GPIO_13_MUX2_SPI0_MISO)

#define PIN_LP_GPIO_5_MUX5_SPI0_MISO               5L           /**< \brief SPI0 signal: MISO on LP_GPIO_5 mux MUX5*/
#define MUX_LP_GPIO_5_MUX5_SPI0_MISO               5           
#define PINMUX_LP_GPIO_5_MUX5_SPI0_MISO            ((PIN_LP_GPIO_5_MUX5_SPI0_MISO << 16) | MUX_LP_GPIO_5_MUX5_SPI0_MISO)

#define PIN_LP_GPIO_9_MUX5_SPI0_MISO               9L           /**< \brief SPI0 signal: MISO on LP_GPIO_9 mux MUX5*/
#define MUX_LP_GPIO_9_MUX5_SPI0_MISO               5           
#define PINMUX_LP_GPIO_9_MUX5_SPI0_MISO            ((PIN_LP_GPIO_9_MUX5_SPI0_MISO << 16) | MUX_LP_GPIO_9_MUX5_SPI0_MISO)

#define PIN_LP_GPIO_19_MUX5_SPI0_MISO              19L           /**< \brief SPI0 signal: MISO on LP_GPIO_19 mux MUX5*/
#define MUX_LP_GPIO_19_MUX5_SPI0_MISO              5           
#define PINMUX_LP_GPIO_19_MUX5_SPI0_MISO           ((PIN_LP_GPIO_19_MUX5_SPI0_MISO << 16) | MUX_LP_GPIO_19_MUX5_SPI0_MISO)

/* ========== PIO definition for SPI1 peripheral ========== */
#define PIN_LP_GPIO_2_MUX4_SPI1_SCK                2L           /**< \brief SPI1 signal: SCK on LP_GPIO_2 mux MUX4*/
#define MUX_LP_GPIO_2_MUX4_SPI1_SCK                4           
#define PINMUX_LP_GPIO_2_MUX4_SPI1_SCK             ((PIN_LP_GPIO_2_MUX4_SPI1_SCK << 16) | MUX_LP_GPIO_2_MUX4_SPI1_SCK)

#define PIN_LP_GPIO_17_MUX4_SPI1_SCK               17L           /**< \brief SPI1 signal: SCK on LP_GPIO_17 mux MUX4*/
#define MUX_LP_GPIO_17_MUX4_SPI1_SCK               4           
#define PINMUX_LP_GPIO_17_MUX4_SPI1_SCK            ((PIN_LP_GPIO_17_MUX4_SPI1_SCK << 16) | MUX_LP_GPIO_17_MUX4_SPI1_SCK)

#define PIN_LP_GPIO_3_MUX4_SPI1_MOSI               3L           /**< \brief SPI1 signal: MOSI on LP_GPIO_3 mux MUX4*/
#define MUX_LP_GPIO_3_MUX4_SPI1_MOSI               4           
#define PINMUX_LP_GPIO_3_MUX4_SPI1_MOSI            ((PIN_LP_GPIO_3_MUX4_SPI1_MOSI << 16) | MUX_LP_GPIO_3_MUX4_SPI1_MOSI)

#define PIN_LP_GPIO_19_MUX4_SPI1_MOSI              19L           /**< \brief SPI1 signal: MOSI on LP_GPIO_19 mux MUX4*/
#define MUX_LP_GPIO_19_MUX4_SPI1_MOSI              4           
#define PINMUX_LP_GPIO_19_MUX4_SPI1_MOSI           ((PIN_LP_GPIO_19_MUX4_SPI1_MOSI << 16) | MUX_LP_GPIO_19_MUX4_SPI1_MOSI)

#define PIN_LP_GPIO_4_MUX4_SPI1_SSN                4L           /**< \brief SPI1 signal: SSN on LP_GPIO_4 mux MUX4*/
#define MUX_LP_GPIO_4_MUX4_SPI1_SSN                4           
#define PINMUX_LP_GPIO_4_MUX4_SPI1_SSN             ((PIN_LP_GPIO_4_MUX4_SPI1_SSN << 16) | MUX_LP_GPIO_4_MUX4_SPI1_SSN)

#define PIN_LP_GPIO_16_MUX4_SPI1_SSN               16L           /**< \brief SPI1 signal: SSN on LP_GPIO_16 mux MUX4*/
#define MUX_LP_GPIO_16_MUX4_SPI1_SSN               4           
#define PINMUX_LP_GPIO_16_MUX4_SPI1_SSN            ((PIN_LP_GPIO_16_MUX4_SPI1_SSN << 16) | MUX_LP_GPIO_16_MUX4_SPI1_SSN)

#define PIN_LP_GPIO_5_MUX4_SPI1_MISO               5L           /**< \brief SPI1 signal: MISO on LP_GPIO_5 mux MUX4*/
#define MUX_LP_GPIO_5_MUX4_SPI1_MISO               4           
#define PINMUX_LP_GPIO_5_MUX4_SPI1_MISO            ((PIN_LP_GPIO_5_MUX4_SPI1_MISO << 16) | MUX_LP_GPIO_5_MUX4_SPI1_MISO)

#define PIN_LP_GPIO_18_MUX4_SPI1_MISO              18L           /**< \brief SPI1 signal: MISO on LP_GPIO_18 mux MUX4*/
#define MUX_LP_GPIO_18_MUX4_SPI1_MISO              4           
#define PINMUX_LP_GPIO_18_MUX4_SPI1_MISO           ((PIN_LP_GPIO_18_MUX4_SPI1_MISO << 16) | MUX_LP_GPIO_18_MUX4_SPI1_MISO)

/* ========== PIO definition for SPI_FLASH0 peripheral ========== */
#define PIN_LP_GPIO_2_MUX6_SPI_FLASH0_SCK          2L           /**< \brief SPI_FLASH0 signal: SCK on LP_GPIO_2 mux MUX6*/
#define MUX_LP_GPIO_2_MUX6_SPI_FLASH0_SCK          6           
#define PINMUX_LP_GPIO_2_MUX6_SPI_FLASH0_SCK       ((PIN_LP_GPIO_2_MUX6_SPI_FLASH0_SCK << 16) | MUX_LP_GPIO_2_MUX6_SPI_FLASH0_SCK)

#define PIN_LP_GPIO_6_MUX6_SPI_FLASH0_SCK          6L           /**< \brief SPI_FLASH0 signal: SCK on LP_GPIO_6 mux MUX6*/
#define MUX_LP_GPIO_6_MUX6_SPI_FLASH0_SCK          6           
#define PINMUX_LP_GPIO_6_MUX6_SPI_FLASH0_SCK       ((PIN_LP_GPIO_6_MUX6_SPI_FLASH0_SCK << 16) | MUX_LP_GPIO_6_MUX6_SPI_FLASH0_SCK)

#define PIN_LP_GPIO_10_MUX6_SPI_FLASH0_SCK         10L          /**< \brief SPI_FLASH0 signal: SCK on LP_GPIO_10 mux MUX6*/
#define MUX_LP_GPIO_10_MUX6_SPI_FLASH0_SCK         6           
#define PINMUX_LP_GPIO_10_MUX6_SPI_FLASH0_SCK      ((PIN_LP_GPIO_10_MUX6_SPI_FLASH0_SCK << 16) | MUX_LP_GPIO_10_MUX6_SPI_FLASH0_SCK)

#define PIN_LP_GPIO_16_MUX2_SPI_FLASH0_SCK         16L           /**< \brief SPI_FLASH0 signal: SCK on LP_GPIO_16 mux MUX2*/
#define MUX_LP_GPIO_16_MUX2_SPI_FLASH0_SCK         2           
#define PINMUX_LP_GPIO_16_MUX2_SPI_FLASH0_SCK      ((PIN_LP_GPIO_16_MUX2_SPI_FLASH0_SCK << 16) | MUX_LP_GPIO_16_MUX2_SPI_FLASH0_SCK)

#define PIN_LP_GPIO_18_MUX2_SPI_FLASH0_SSN         18L           /**< \brief SPI_FLASH0 signal: SSN on LP_GPIO_18 mux MUX2*/
#define MUX_LP_GPIO_18_MUX2_SPI_FLASH0_SSN         2           
#define PINMUX_LP_GPIO_18_MUX2_SPI_FLASH0_SSN      ((PIN_LP_GPIO_18_MUX2_SPI_FLASH0_SSN << 16) | MUX_LP_GPIO_18_MUX2_SPI_FLASH0_SSN)

#define PIN_LP_GPIO_4_MUX6_SPI_FLASH0_SSN          4L           /**< \brief SPI_FLASH0 signal: SSN on LP_GPIO_4 mux MUX6*/
#define MUX_LP_GPIO_4_MUX6_SPI_FLASH0_SSN          6           
#define PINMUX_LP_GPIO_4_MUX6_SPI_FLASH0_SSN       ((PIN_LP_GPIO_4_MUX6_SPI_FLASH0_SSN << 16) | MUX_LP_GPIO_4_MUX6_SPI_FLASH0_SSN)

#define PIN_LP_GPIO_8_MUX6_SPI_FLASH0_SSN          8L           /**< \brief SPI_FLASH0 signal: SSN on LP_GPIO_8 mux MUX6*/
#define MUX_LP_GPIO_8_MUX6_SPI_FLASH0_SSN          6           
#define PINMUX_LP_GPIO_8_MUX6_SPI_FLASH0_SSN       ((PIN_LP_GPIO_8_MUX6_SPI_FLASH0_SSN << 16) | MUX_LP_GPIO_8_MUX6_SPI_FLASH0_SSN)

#define PIN_LP_GPIO_12_MUX6_SPI_FLASH0_SSN         12L          /**< \brief SPI_FLASH0 signal: SSN on LP_GPIO_12 mux MUX6*/
#define MUX_LP_GPIO_12_MUX6_SPI_FLASH0_SSN         6           
#define PINMUX_LP_GPIO_12_MUX6_SPI_FLASH0_SSN      ((PIN_LP_GPIO_12_MUX6_SPI_FLASH0_SSN << 16) | MUX_LP_GPIO_12_MUX6_SPI_FLASH0_SSN)

#define PIN_LP_GPIO_16_MUX6_SPI_FLASH0_SSN         16L           /**< \brief SPI_FLASH0 signal: SSN on LP_GPIO_16 mux MUX6*/
#define MUX_LP_GPIO_16_MUX6_SPI_FLASH0_SSN         6           
#define PINMUX_LP_GPIO_16_MUX6_SPI_FLASH0_SSN      ((PIN_LP_GPIO_16_MUX6_SPI_FLASH0_SSN << 16) | MUX_LP_GPIO_16_MUX6_SPI_FLASH0_SSN)

