remotemcu/remcu-chip-sdks/SAM/xdk-asf-3.45.0/sam0/utils/cmsis/samb11/include/pio/pio_samb11g18a.h
#define PIN_LP_GPIO_3_MUX6_SPI_FLASH0_TXD          3L           /**< \brief SPI_FLASH0 signal: TXD on LP_GPIO_3 mux MUX6*/
#define MUX_LP_GPIO_3_MUX6_SPI_FLASH0_TXD          6           
#define PINMUX_LP_GPIO_3_MUX6_SPI_FLASH0_TXD       ((PIN_LP_GPIO_3_MUX6_SPI_FLASH0_TXD << 16) | MUX_LP_GPIO_3_MUX6_SPI_FLASH0_TXD)

#define PIN_LP_GPIO_7_MUX6_SPI_FLASH0_TXD          7L           /**< \brief SPI_FLASH0 signal: TXD on LP_GPIO_7 mux MUX6*/
#define MUX_LP_GPIO_7_MUX6_SPI_FLASH0_TXD          6           
#define PINMUX_LP_GPIO_7_MUX6_SPI_FLASH0_TXD       ((PIN_LP_GPIO_7_MUX6_SPI_FLASH0_TXD << 16) | MUX_LP_GPIO_7_MUX6_SPI_FLASH0_TXD)

#define PIN_LP_GPIO_11_MUX6_SPI_FLASH0_TXD         11L          /**< \brief SPI_FLASH0 signal: TXD on LP_GPIO_11 mux MUX6*/
#define MUX_LP_GPIO_11_MUX6_SPI_FLASH0_TXD         6           
#define PINMUX_LP_GPIO_11_MUX6_SPI_FLASH0_TXD      ((PIN_LP_GPIO_11_MUX6_SPI_FLASH0_TXD << 16) | MUX_LP_GPIO_11_MUX6_SPI_FLASH0_TXD)

#define PIN_LP_GPIO_17_MUX2_SPI_FLASH0_TXD         17L           /**< \brief SPI_FLASH0 signal: TXD on LP_GPIO_17 mux MUX2*/
#define MUX_LP_GPIO_17_MUX2_SPI_FLASH0_TXD         2           
#define PINMUX_LP_GPIO_17_MUX2_SPI_FLASH0_TXD      ((PIN_LP_GPIO_17_MUX2_SPI_FLASH0_TXD << 16) | MUX_LP_GPIO_17_MUX2_SPI_FLASH0_TXD)

#define PIN_LP_GPIO_5_MUX6_SPI_FLASH0_RXD          5L           /**< \brief SPI_FLASH0 signal: RXD on LP_GPIO_5 mux MUX6*/
#define MUX_LP_GPIO_5_MUX6_SPI_FLASH0_RXD          6           
#define PINMUX_LP_GPIO_5_MUX6_SPI_FLASH0_RXD       ((PIN_LP_GPIO_5_MUX6_SPI_FLASH0_RXD << 16) | MUX_LP_GPIO_5_MUX6_SPI_FLASH0_RXD)

#define PIN_LP_GPIO_9_MUX6_SPI_FLASH0_RXD          9L           /**< \brief SPI_FLASH0 signal: RXD on LP_GPIO_9 mux MUX6*/
#define MUX_LP_GPIO_9_MUX6_SPI_FLASH0_RXD          6           
#define PINMUX_LP_GPIO_9_MUX6_SPI_FLASH0_RXD       ((PIN_LP_GPIO_9_MUX6_SPI_FLASH0_RXD << 16) | MUX_LP_GPIO_9_MUX6_SPI_FLASH0_RXD)

#define PIN_LP_GPIO_13_MUX6_SPI_FLASH0_RXD         13L          /**< \brief SPI_FLASH0 signal: RXD on LP_GPIO_13 mux MUX6*/
#define MUX_LP_GPIO_13_MUX6_SPI_FLASH0_RXD         6           
#define PINMUX_LP_GPIO_13_MUX6_SPI_FLASH0_RXD      ((PIN_LP_GPIO_13_MUX6_SPI_FLASH0_RXD << 16) | MUX_LP_GPIO_13_MUX6_SPI_FLASH0_RXD)

#define PIN_LP_GPIO_18_MUX6_SPI_FLASH0_RXD         18L           /**< \brief SPI_FLASH0 signal: RXD on LP_GPIO_18 mux MUX6*/
#define MUX_LP_GPIO_18_MUX6_SPI_FLASH0_RXD         6           
#define PINMUX_LP_GPIO_18_MUX6_SPI_FLASH0_RXD      ((PIN_LP_GPIO_18_MUX6_SPI_FLASH0_RXD << 16) | MUX_LP_GPIO_18_MUX6_SPI_FLASH0_RXD)

#define PIN_LP_GPIO_19_MUX2_SPI_FLASH0_RXD         19L           /**< \brief SPI_FLASH0 signal: RXD on LP_GPIO_19 mux MUX2*/
#define MUX_LP_GPIO_19_MUX2_SPI_FLASH0_RXD         2           
#define PINMUX_LP_GPIO_19_MUX2_SPI_FLASH0_RXD      ((PIN_LP_GPIO_19_MUX2_SPI_FLASH0_RXD << 16) | MUX_LP_GPIO_19_MUX2_SPI_FLASH0_RXD)

#define MEGAMUX_UART0_RXD                          0x0
#define MEGAMUX_UART0_TXD                          0x1
#define MEGAMUX_UART0_CTS                          0x2
#define MEGAMUX_UART0_RTS                          0x3
#define MEGAMUX_UART1_RXD                          0x4
#define MEGAMUX_UART1_TXD                          0x5
#define MEGAMUX_UART1_CTS                          0x6
#define MEGAMUX_UART1_RTS                          0x7
#define MEGAMUX_I2C0_SDA                           0x8
#define MEGAMUX_I2C0_SCL                           0x9
#define MEGAMUX_I2C1_SDA                           0xa
#define MEGAMUX_I2C1_SCL                           0xb
#define MEGAMUX_PWM1_OUT                           0xc
#define MEGAMUX_PWM2_OUT                           0xd
#define MEGAMUX_PWM3_OUT                           0xe
#define MEGAMUX_PWM4_OUT                           0xf
#define MEGAMUX_32KHZ_CLK                          0x10
#define MEGAMUX_COEX_WLAN_TX                       0x11
#define MEGAMUX_COEX_WLAN_RX                       0x12
#define MEGAMUX_COEX_BLE_TX                        0x13
#define MEGAMUX_COEX_BLE_RX                        0x14
#define MEGAMUX_COEX_BLE_IN_PROCESS                0x15
#define MEGAMUX_COEX_BLE_MBSY                      0x16
#define MEGAMUX_COEX_BLE_SYNC                      0x17
#define MEGAMUX_COEX_BLE_RXNTX                     0x18
#define MEGAMUX_COEX_BLE_PTI_0                     0x19
#define MEGAMUX_COEX_BLE_PTI_1                     0x1a
#define MEGAMUX_COEX_BLE_PTI_2                     0x1b
#define MEGAMUX_COEX_BLE_PTI_3                     0x1c
#define MEGAMUX_QUAD_DEC0_A                        0x1d
#define MEGAMUX_QUAD_DEC0_B                        0x1e
#define MEGAMUX_QUAD_DEC1_A                        0x1f
#define MEGAMUX_QUAD_DEC1_B                        0x20
#define MEGAMUX_QUAD_DEC2_A                        0x21
#define MEGAMUX_QUAD_DEC2_B                        0x22

#define PINMUX_MEGAMUX_FUNCTION_SELECT(megamux_function)		((megamux_function << 8) | 1)

#endif /* _SAMB11G18A_PIO_ */